In [1]:
import numpy as np

In [2]:
import pandas as pd

In [5]:
print(pd.__version__)

2.2.2

In [6]:
A=pd.Series([2,3,4,5],index=['a','b','c','d'])

In [7]:
A.values

array([2, 3, 4, 5])

In [8]:
type(A.values)

numpy.ndarray

In [9]:
type(A)

pandas.core.series.Series

In [10]:
A.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [11]:
A['a']

np.int64(2)

In [12]:
A['a':'c']

a    2
b    3
c    4
dtype: int64

In [13]:
grades_dict={'A':4,'B':3.5,'C':3,'D':2.5}
grades=pd.Series(grades_dict)

In [15]:
grades.values

array([4. , 3.5, 3. , 2.5])

In [16]:
grades.index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
marks_dict={'A':85,'B':75,'C':65,'D':55}
marks=pd.Series(marks_dict)

In [18]:
marks

A    85
B    75
C    65
D    55
dtype: int64

In [19]:
marks['A']

np.int64(85)

In [20]:
marks[0:2]

A    85
B    75
dtype: int64

In [21]:
D=pd.DataFrame({'Marks':marks,'Grades':grades})

In [22]:
D

   Marks  Grades
A     85     4.0
B     75     3.5
C     65     3.0
D     55     2.5

In [23]:
D.T

           A     B     C     D
Marks   85.0  75.0  65.0  55.0
Grades   4.0   3.5   3.0   2.5

In [24]:
D.values

array([[85. ,  4. ],
       [75. ,  3.5],
       [65. ,  3. ],
       [55. ,  2.5]])

In [25]:
D.values[2,0]

np.float64(65.0)

In [26]:
D.columns

Index(['Marks', 'Grades'], dtype='object')

In [28]:
D['ScaledMarks']=100*(D['Marks']/90)

In [29]:
D

   Marks  Grades  ScaledMarks
A     85     4.0    94.444444
B     75     3.5    83.333333
C     65     3.0    72.222222
D     55     2.5    61.111111

In [31]:
del D['ScaledMarks']

In [32]:
D

   Marks  Grades
A     85     4.0
B     75     3.5
C     65     3.0
D     55     2.5

In [33]:
G=D[D['Marks']>70]

In [34]:
G

   Marks  Grades
A     85     4.0
B     75     3.5

In [37]:
A=pd.DataFrame([{'a':1,'b':4},{'b':-3,'c':9}])

In [38]:
A

     a  b    c
0  1.0  4  NaN
1  NaN -3  9.0

In [39]:
A.fillna(0)

     a  b    c
0  1.0  4  0.0
1  0.0 -3  9.0

In [40]:
A=pd.Series(['a','b','c'],index=[1,3,5])

In [41]:
A[1]

'a'

In [42]:
A[1:3]

3    b
5    c
dtype: object

In [43]:
A.loc[1:3]

1    a
3    b
dtype: object

In [44]:
A.iloc[1:3]

3    b
5    c
dtype: object

In [45]:
D

   Marks  Grades
A     85     4.0
B     75     3.5
C     65     3.0
D     55     2.5

In [46]:
D.iloc[2,:]

Marks     65.0
Grades     3.0
Name: C, dtype: float64

In [47]:
D.iloc[::-1,:]

   Marks  Grades
D     55     2.5
C     65     3.0
B     75     3.5
A     85     4.0